RhinoInside.Revit API Documentation
GeometryEncoder.ToLine Method
 Converts the specified Line to an equivalent Revit Line.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8018
Syntax
public static Autodesk.Revit.DB.Line ToLine(
	this Rhino.Geometry.Line value
)
Parameters
value
Type: Rhino.Geometry.Line
A value to convert.
Return Value
Type: Autodesk.Revit.DB.Line
A Revit Line that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Line. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace